src/tests/load/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 20
      rampTo: 50
      name: "Stress test phase"
  processor: "./load-test-functions.js"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Recipe suggestions and meal planning flow"
    weight: 7
    flow:
      - function: "generateTestUser"
      - post:
          url: "/api/auth/register"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            name: "{{ name }}"
            preferences:
              dietaryRestrictions: ["vegetarian"]
              allergies: ["nuts"]
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - post:
          url: "/api/inventory/add"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            items:
              - item: "rice"
                quantity: 2
              - item: "tofu"
                quantity: 1
              - item: "vegetables"
                quantity: 3
      - think: 1
      - get:
          url: "/api/suggestions/recipes"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2
      - post:
          url: "/api/mealplans/generate"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            startDate: "{{ currentDate }}"
            days: 3
            mealsPerDay: 2

  - name: "Inventory operations"
    weight: 3
    flow:
      - function: "generateTestUser"
      - post:
          url: "/api/auth/register"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            name: "{{ name }}"
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - loop:
          - post:
              url: "/api/inventory/add"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                items:
                  - item: "{{ $randomItem }}"
                    quantity: "{{ $randomInt 1 5 }}"
          - think: 1
          - get:
              url: "/api/inventory"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 5